{
  "What types of events do you perform at as a cellist?": "As a professional cellist based in Cardiff, I specialise in performing at weddings across South Wales and Bristol, providing elegant cello music for ceremonies and receptions. I also perform at corporate events, private parties, and concerts. My repertoire spans classical, contemporary, and popular music, making it suitable for any special occasion.",

  "How much does it cost to hire a wedding cellist?": "Wedding cellist prices start from £350, with the final quote depending on factors such as travel distance (across South Wales and Bristol), date, performance duration, and specific requirements. Each quote is tailored to your event needs. Contact me for a personalised quote - I'll respond within a few hours!",

  "How do I book a cellist for my wedding?": "Booking your wedding cellist is simple: Send a message through the contact form or call directly. Tell me about your wedding plans, including the date, venue, and type of music you'd like. I'll provide a detailed quote, and if you're happy, we'll proceed with securing your date.",

  "Do you have insurance for wedding performances?": "Yes, as a professional wedding musician, I have comprehensive public liability insurance (PLI) through the Musicians' Union. Insurance certificates are available upon request - many wedding venues require this documentation.",

  "Can you play specific songs for our wedding ceremony?": "Absolutely! I love learning special request songs for weddings. With a repertoire of over 300 pieces spanning classical, pop, and film music, I can accommodate most requests. Whether it's your favourite pop song or a classical piece, I'll ensure it's perfect for your special day!",

  "Can you perform outdoor wedding ceremonies?": "Yes! I regularly perform at outdoor wedding ceremonies across South Wales and Bristol, weather permitting. I recommend having an indoor backup location arranged. My acoustic and electric cellos are suitable for both indoor and outdoor performances.",

  "What payment methods do you accept for wedding bookings?": "I accept bank transfers for wedding music bookings. Once you're ready to proceed, I'll provide payment details along with a professional performance contract that outlines all arrangements for your wedding day.",

  "Can we choose specific songs for different parts of our wedding?": "Absolutely! As your wedding cellist, I'll work closely with you to select perfect music for each part of your day - from ceremony entrance to signing the register, exit music, and drinks reception. My extensive repertoire includes classical wedding favourites, modern pop songs, and film themes.",

  "What happens if you're unable to perform at our wedding?": "Your wedding day is incredibly important, which is why I maintain a network of professional wedding cellists who can step in during emergencies. These carefully selected musicians know my repertoire and maintain the same high performance standards, ensuring your wedding music will be beautiful no matter what.",

  "Is a deposit required to secure our wedding date?": "Yes, I require a deposit to secure your wedding date in my calendar. Popular dates, especially summer weekends, often book 12-18 months in advance. The remaining balance is due closer to your wedding day, and all payment terms are clearly outlined in your contract.",

  "How far in advance should we book a cellist for our wedding?": "For wedding ceremonies and receptions, I recommend booking 12-18 months in advance, especially for peak season dates (May-September) and weekend celebrations. This ensures you secure your preferred cellist for your special day and allows plenty of time for music selection and planning.",

  "What music styles can you play on the cello?": "As a versatile cellist, I perform a wide range of music styles including classical wedding music, modern pop songs, film soundtracks, and traditional Welsh music. My repertoire includes pieces from composers like Bach and Vivaldi, contemporary artists like Ed Sheeran and Coldplay, and soundtracks from films like Harry Potter and Game of Thrones. Visit my repertoire page to explore the full range!",

  "Do you provide music for the entire wedding day?": "Yes! I can provide cello music throughout your wedding day: ceremony entrance music, signing of the register, ceremony exit, drinks reception, and wedding breakfast background music. Many couples in South Wales and Bristol book me for multiple parts of their day to create a cohesive musical atmosphere.",

  "What's the difference between acoustic and electric cello for weddings?": "I offer both acoustic and electric cello for weddings. The acoustic cello provides that traditional, rich, classical sound perfect for ceremonies. The electric cello, with its amplification capabilities, works brilliantly for larger venues, outdoor settings, and when playing contemporary pop songs during receptions. Both instruments are available, and we can discuss which would best suit your venue and musical preferences.",

  "Can you perform with other musicians for our wedding?": "Yes! While I primarily perform as a solo cellist, I also work with other professional musicians through my string quartet, Aderyn String Quartet. We can provide various combinations - cello and violin duo, string trio, or full quartet - perfect for creating different atmospheres throughout your wedding day.",

  "How long do you typically perform at weddings?": "Most wedding ceremony bookings are for 2 hours, covering guest arrival, the ceremony itself, and photos afterward. For reception bookings, I typically perform 2-3 hour sets. I'm flexible with timing and can create a custom package to suit your schedule and requirements.",

  "Do you provide your own equipment?": "Yes, I bring everything needed for a professional performance, including my own high-quality PA system when required for the electric cello. I also bring music stands, battery-powered amplification for outdoor performances, and all necessary cables. You just need to provide a chair and access to a power socket if we're using amplification.",

  "What happens if it rains during our outdoor wedding ceremony?": "For outdoor weddings in Wales and Bristol, I work closely with your wedding coordinator to monitor weather conditions. I can quickly relocate to your wet-weather backup location if needed, and my equipment is suitable for both indoor and covered outdoor spaces. I recommend having a backup indoor location arranged - I'm experienced in handling last-minute changes smoothly.",

  "Do you take breaks during longer performances?": "For performances longer than 2 hours, I typically take short breaks (usually 10-15 minutes per hour) to maintain the highest performance quality. These breaks are always discussed and agreed upon in advance to ensure they don't interrupt key moments of your day.",

  "Can we meet you before booking?": "Absolutely! While many couples book after our phone/video consultations, I'm happy to arrange a meeting in Cardiff or surrounding areas. You can also watch my performance videos online and read reviews from previous wedding couples. Meeting in person is a great way to discuss your music ideas and ensure we're the perfect fit for your special day.",

  "What areas do you cover for weddings?": "Based in Cardiff, I primarily perform at weddings across South Wales, including Newport, Swansea, and the Vale of Glamorgan. I also regularly travel to Bristol, Bath, and the South West. Travel costs are included within a certain radius, with a small supplement for locations further afield."
}
